#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/clement-martzloff/gh-actions-demo/runs/run-gqof5d9meQjTAoEQ

Waiting for the plan to start...

Terraform v0.14.2
Configuring remote state backend...
Initializing Terraform configuration...
random_pet.sg: Refreshing state... [id=musical-rat]
aws_security_group.web-sg: Refreshing state... [id=sg-0974b87fcb18d1d4b]
aws_instance.web: Refreshing state... [id=i-080dfbdd4c3955ccf]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_default_vpc.default will be created
  + resource "aws_default_vpc" "default" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = (known after apply)
      + cidr_block                       = (known after apply)
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = (known after apply)
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "Default VPC"
        }
    }

  # aws_instance.web will be updated in-place
  ~ resource "aws_instance" "web" {
        id                           = "i-080dfbdd4c3955ccf"
        tags                         = {}
      ~ vpc_security_group_ids       = [
          - "sg-0974b87fcb18d1d4b",
        ] -> (known after apply)
        # (27 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_security_group.web-sg must be replaced
-/+ resource "aws_security_group" "web-sg" {
      ~ arn                    = "arn:aws:ec2:eu-central-1:314721813874:security-group/sg-0974b87fcb18d1d4b" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-0974b87fcb18d1d4b" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "http"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
        name                   = "musical-rat-sg"
      ~ owner_id               = "314721813874" -> (known after apply)
      - tags                   = {} -> null
      ~ vpc_id                 = "vpc-e28e3088" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```

</details>

*Pusher: @Clement-Martzloff, Action: `pull_request`*